


* Free Faculty: working examples
:PROPERTIES:
:ID:       d2361185-7120-47dc-b6e1-619583e4b249
:PUBDATE:  <2015-10-08 Thu 20:49>
:END:

http://pj.freefaculty.org/R/WorkingExamples/


#+begin_src R

  ## http://pj.freefaculty.org/R/WorkingExamples/data-array-1.R

  dat <- data.frame(F_WHI_5_Var_1 = c(0, 0, 11, 19, 21),
                    F_WHI_7_Var_1 = c(22, 1, 0, 0, 0),
                    M_WHI_5_Var_1 = c(0, 0, 31, 11, 41),
                    M_WHI_7_Var_1 = c(0, 51, 0, 0, 0),
                    F_BLA_5_Var_1 = c(0, 0, 11, 17, 1),
                    F_BLA_7_Var_1 = c(0, 11, 0, 0, 0),
                    M_BLA_5_Var_1 = c(0, 0, 21, 31, 41),
                    M_BLA_7_Var_1 = c(0, 71, 0, 0, 0),
                    F_WHI_5_Var_2 = c(0, 0, 31, 99, 81),
                    F_WHI_7_Var_2 = c(2, 11, 0, 0, 0),
                    M_WHI_5_Var_2 = c(0, 0, 14, 12, 31),
                    M_WHI_7_Var_2 = c(0, 1, 0, 0, 0),
                    F_BLA_5_Var_2 = c(0, 0, 13, 14, 1),
                    F_BLA_7_Var_2 = c(0, 11, 0, 0, 0),
                    M_BLA_5_Var_2 = c(0, 0, 21, 31, 41),
                    M_BLA_7_Var_2 = c(0, 71, 0, 0, 0)
                    )

  dat
#+end_src

#+RESULTS:
|  0 | 22 |  0 |  0 |  0 |  0 |  0 |  0 |  0 |  2 |  0 | 0 |  0 |  0 |  0 |  0 |
|  0 |  1 |  0 | 51 |  0 | 11 |  0 | 71 |  0 | 11 |  0 | 1 |  0 | 11 |  0 | 71 |
| 11 |  0 | 31 |  0 | 11 |  0 | 21 |  0 | 31 |  0 | 14 | 0 | 13 |  0 | 21 |  0 |
| 19 |  0 | 11 |  0 | 17 |  0 | 31 |  0 | 99 |  0 | 12 | 0 | 14 |  0 | 31 |  0 |
| 21 |  0 | 41 |  0 |  1 |  0 | 41 |  0 | 81 |  0 | 31 | 0 |  1 |  0 | 41 |  0 |




